chris-emacs.org
#+title: GNU Emacs
#+author: chriswifn
#+language: en
#+options: ':t toc:nil num:t author:t
#+startup: content indent
#+macro: latest-export-date (eval (format-time-string "%F %T %z"))

*Last revised and exported on {{{latest-export-date}}}.*

This is my literate configuration for GNU Emacs.

This Org document serves as a single point of entry to my Emacs setup.
In contrast to most literate configurations, this file is not loaded
by calling ~org-babel-load-file~ to produce a generic =init.el=.
By not loading Org before loading Emacs the startup time is much slower.
The advantage to creating separate =.el= files manually is that this file
serves as the =single-source-of-truth= that can be distributed to any
personal machine.

#+toc: headlines 8 insert TOC here, with eight headline levels

* The early initialisation of Emacs (=early-init.el=)
:PROPERTIES:
:ID:       75cc7941-14d8-4cce-aa70-a17964586009
:END:

This is the first file emacs reads when starting up.

** The =early-init.el= basic frame settings
:PROPERTIES:
:ID:       a37dca00-1ab3-48aa-99a0-1c851a24e987
:END:

Minimal setup with less distractions.
For detailed description of what these variables do, consider
looking at the documentation with ~C-h v name-of-variable~.

#+begin_src emacs-lisp :tangle "early-init.el"
  (setq frame-resize-pixelwise t
        frame-inhibit-implied-resize t
        frame-title-format '("%b")
        ring-bell-function 'ignore
        use-dialog-box nil
        use-short-answers t
        inhibit-splash-screen t
        inhibit-startup-screen t
        inhibit-startup-echo-area-message user-login-name
        inhibit-startup-buffer-menu t)

  ;; disable graphical elements by default
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (fringe-mode 0)
#+end_src

** The =early-init.el= option to tweak startup time
:PROPERTIES:
:ID:       5765d7a3-c20d-4d12-a64c-67fc8cbce955
:END:

Put emacs into the 21st century.
Increase garbage collection threshold for increased performance.

#+begin_src emacs-lisp :tangle "early-init.el"
  (setq gc-cons-threshold most-positive-fixnum
	gc-cons-percentage 0.5)

  (add-hook 'emacs-startup-hook
	    (lambda ()
	      (setq gc-cons-threshold (* 1000 1000 8)
		    gc-cons-percentage 0.1)))
#+end_src

** The =early-init.el= disables the package cache
:PROPERTIES:
:ID:       62f1575a-a04d-4f9b-9f32-b8374808215d
:END:

This configuration uses the =use-package= macro.
=use-package= is great, because it allows for a "quick-and-dirty"
installation of packages without having to look into hooks for the
most part.
Since Emacs 29 it is built-in.
Therefor, the "old way" of installing packages can be disabled
on early startup.

#+begin_src emacs-lisp :tangle "early-init.el"
  (setq package-enable-at-startup nil)
#+end_src

* The main initialisation of Emacs (=init.el=)
:PROPERTIES:
:ID:       1aa6d5af-495a-4a97-b636-9f0ab6eb78fc
:END:

** The =init.el= package system setup
:PROPERTIES:
:ID:       5089b9e7-c0ff-48b2-8c3e-ba4c4a45dc46
:END:

Emacs has a built in package manager =package.el= but it doesn't make it
easy to automatically install packages on a new system the first time
to configuration is loaded. This is why I use =use-package=.
And since Emacs 29 it is also built in.

#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)
#+end_src

** The =init.el= basic configurations to disable backups and lockfiles
:PROPERTIES:
:ID:       c3451e24-9d95-4a9e-8cba-1dbe9101bc99
:END:

By default, Emacs tries to lock down files so that they are not modified
by other programs. It also keeps backups. These are features are are
annoying for me, because in most cases I know what I am doing when I
modify files externally and I don't want emacs backup files everywhere.

#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  (setq make-backup-files nil)
  (setq backup-inhibited nil)
  (setq create-lockfiles nil)
#+end_src

** The =init.el= tweaks to make native compilation silent
:PROPERTIES:
:ID:       c4c99118-1e6f-4ea6-b3bd-82917259144f
:END:

Native compilation is new since Emacs 28.
It for the most part works fine, but the eventual popup is annoying.
So disabling it, gets rid of the popup buffers it generates.

#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  (when (native-comp-available-p)
    (setq native-comp-async-report-warning-errors 'silent) ;; Emacs 28
    (setq native-compile-prune-cache t)) ;; Emacs 29
#+end_src

** The =init.el= setting to send custom-file into the void
:PROPERTIES:
:ID:       b6752d66-ad95-4856-9f7f-d48f163763e2
:END:

Emacs writing customizations into the main configuration file
is a crime against humanity.
The custom-file solves this issue by moving the automatically
generated configurations to a separate file.
However I don't need that, because I want everything managed
by this Org document

#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  (setq custom-file (make-temp-file "emacs-custom-"))
#+end_src

** The =init.el= setting to start emacs in fullscreen mode
:PROPERTIES:
:ID:       890816f0-ae99-4737-aa25-a11af5bc4640
:END:

Because I have a high resolution monitor, I set a big font size.
Therefore Emacs looks weird when starting up with standard geometry.
And nobody wants to leave Emacs when first starting it, so fullscreen
is not an issue.

#+begin_src emacs-lisp :tangle "init.el"
  (add-hook 'window-setup-hook 'toggle-frame-maximized t)
#+end_src

** The =init.el= setting to kill buffers
:PROPERTIES:
:ID:       fc922ed4-fbad-4c61-abc0-63bc4264510b
:END:

Killing a buffer should close the split.
There is a built-in function that does exactly that.
The problem is, that that function is mapped to ~C-x 4 0~.

#+begin_src emacs-lisp :tangle "init.el"
  (bind-key "C-x k" 'kill-buffer-and-window)
#+end_src

** The =init.el= setting for ~exec-path~
:PROPERTIES:
:ID:       519291f6-b776-4ca6-9d2f-283994b4574b
:END:

When launching Emacs from non shell processes, it can happen, that
the ~$PATH~ variable is not correctly set on startup.
This is especially annoying for certain projects that depend on a
specific directory or eglot (because I install language-servers manually).

The function is there to quickly set the path when changed in the SHELL.

#+begin_src emacs-lisp
  (setq exec-path (append '("~/.local/bin") exec-path))

  (defun set-exec-path-from-shell-PATH ()
    "Set up Emacs' `exec-path' and PATH environment variable to match
  that used by the user's shell.

  This is particularly useful under Mac OS X and macOS, where GUI
  apps are not started from a shell."
    (interactive)
    (let ((path-from-shell (replace-regexp-in-string
                            "[ \t\n]*$" "" (shell-command-to-string
                                            "$SHELL --login -c 'echo $PATH'"
                                            ))))
      (setenv "PATH" path-from-shell)
      (setq exec-path (split-string path-from-shell path-separator))))
#+end_src

** The =init.el= arrangements for my own modules
:PROPERTIES:
:ID:       c137a31e-a1a7-4818-b2dd-5e4b0a2ef391
:END:

Add a few directories to the load-path in order to group
certain configurations together and a place for private modules.

#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  (mapc
   (lambda (string)
     (add-to-list 'load-path (locate-user-emacs-file string)))
   '("chris-lisp" "chris-private"))

  (require 'chris-emacs-ui)
  (require 'chris-emacs-org)
  (require 'chris-completion)
  (require 'chris-evil)
  (require 'chris-programming)
  (require 'chris-denote)
  (require'chris-misc)
#+end_src

* The modules of my Emacs configuration
:PROPERTIES:
:ID:       2bae306e-f13d-4900-a1d9-41cf6c65a0f4
:END:

The =init.el= specifies the ~load-path~ to some custom modules.
These mostly consist of package installation/configuration.
See [[*The =init.el= arrangements for my own modules][The =init.el= arrangements for my own modules]]

** The =chris-emacs-ui.el= module
:PROPERTIES:
:ID:       c085750d-6ed1-4782-994e-99f40c72d077
:END:

A place to configure the Emacs UI.
Note that some visual settings are already made in
[[*The =early-init.el= basic frame settings][The =early-init.el= basic frame settings]]

*** Lexical bindings
#+begin_src emacs-lisp :tangle "chris-lisp/chris-emacs-ui.el" :mkdirp yes
  ;;; chris-emacs-ui.el -*- lexical-binding: t; -*-
#+end_src
*** Font configuration
:PROPERTIES:
:ID:       2faede72-1d1c-4736-b033-80e79b2d6972
:END:

The following should be minimally readable by any font:

| Similarities | Regular                    |
|--------------+----------------------------|
| ()[]{}<>«»‹› | ABCDEFGHIJKLMNOPQRSTUVWXYZ |
| 6bB8&        | abcdefghijklmnopqrstuvwxyz |
| 0ODdoaoOQGC  | 0123456789                 |
| I1tilIJL     | ~!@#$%^&*+                 |
| !¡ij         | `'"‘’“”.,;:…               |
| 5$§SsS5      | ()[]{}—-_=<>/\             |
| 17ZzZ2       | ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ   |
| 9gqpG6       | αβγδεζηθικλμνξοπρστυφχψω   |
| hnmMN        |                            |
| uvvwWuuwvy   |                            |
| x×X          |                            |
| .,·°%        |                            |
| ¡!¿?         |                            |
| :;           |                            |
| `''"‘’“”     |                            |
| —-~≈=≠+*_    |                            |
| …⋯           |                            |
| ...          |                            |

Not having a specific font installed on a new system is a pain.
Therefor I specify a list of fonts to go through which includes
a fallback font that is most likely going to be installed on any
system.

*Specifying a fixed width font.*

#+begin_src emacs-lisp :tangle "chris-lisp/chris-emacs-ui.el" :mkdirp yes
  (defvar chris-fixed-font
    (when window-system
      (or
       (seq-first
        (seq-filter (lambda (font) (when (x-list-fonts font) font))
                    '("UbuntuMono"
                      "Source Code Pro"
                      "monospace")))
       "monospaced"))
    "My fixed width font based on what I have installed.")
#+end_src

*Specifying a variable pitch font.*

#+begin_src emacs-lisp :tangle "chris-lisp/chris-emacs-ui.el" :mkdirp yes
  (defvar chris-variable-font
    (when window-system
      (or
       (seq-first
        (seq-filter (lambda (font) (when (x-list-fonts font) font))
                    '("Iosevka Comfy Duo"
                      "Sans Serif")))
       (warn "Cannot find a Serif Font. Install one."))))
#+end_src

*Setting a font size.*

#+begin_src emacs-lisp :tangle "chris-lisp/chris-emacs-ui.el" :mkdirp yes
  (defun chris-set-font-size (size)
    "Set the default font size as well as equalize the fixed and
  variable fonts."
    (let ((fav-font (format "%s-%d" chris-fixed-font size)))
      (set-face-attribute 'default nil :font fav-font)
      (set-face-attribute 'fixed-pitch nil :family chris-fixed-font :inherit 'default :height 1.0)
      (set-face-attribute 'variable-pitch nil :family chris-variable-font :inherit 'default :height 1.2)))
#+end_src

Define /interactive/ functions to quickly adjust the font size based on my
computing scenario:

#+begin_src emacs-lisp :tangle "chris-lisp/chris-emacs-ui.el" :mkdirp yes
  (defun chris-home-lab ()
    "Quickly set reset my font size when laptop is connected to home lab."
    (interactive)
    (chris-set-font-size 24))

  (defun chris-external ()
    "Quickly set reset my font size when laptop is used externally."
    (interactive)
    (chris-set-font-size 12))

  (chris-home-lab)
#+end_src

