chris-emacs.org
*** Theme
:PROPERTIES:
:ID:       8e3f3c52-4395-4d83-a70a-1eebb487ebc8
:END:

I use a built-in Emacs theme at this point. I think Emacs has to be version
28 or higher for this particular theme to be there by default.

The only requirement I have is that the theme I use both has a light and a dark
variant.

The modus themes are very nice because they provide a default option for mixed fonts.
This makes it so that I don't have to set it up manually or install a third party
package to use variable fonts in org-mode mostly.
This is very important for source code blocks and tables because they look off
when not using a ~fixed-pitch-font~.

The theme also provides a neat way of switching between light and dark by using
=modus-themes-toggle=.

#+begin_src emacs-lisp :tangle "chris-lisp/chris-emacs-ui.el" :mkdirp yes
  ;; (setq modus-themes-mixed-fonts t)
  ;; (load-theme 'modus-vivendi t)
  ;; (use-package color-theme-sanityinc-tomorrow)

  (use-package doom-themes
    :config
    (setq doom-themes-enable-bold t
          doom-themes-enable-italic nil)
    (load-theme 'doom-gruvbox t))
#+end_src

*** Spacious Padding
:PROPERTIES:
:ID:       1988f032-29fa-44ec-951d-53aadf230f08
:END:

Padding makes the editor look more modern.
I use Protesilaos Stavrous' package =spacious-padding=.
In effect it adds some padding where it is smart to have some padding

#+begin_src emacs-lisp :tangle "chris-lisp/chris-emacs-ui.el" :mkdirp yes
  (use-package spacious-padding
    :init
    (spacious-padding-mode t))
#+end_src

*** Providing the module
:PROPERTIES:
:ID:       95554cb3-93b2-48e9-ac6f-d4d06bda6c49
:END:

#+begin_src emacs-lisp :tangle "chris-lisp/chris-emacs-ui.el" :mkdirp yes
  (provide 'chris-emacs-ui)
#+end_src

** The =chris-emacs-org= module
:PROPERTIES:
:ID:       d96d6797-3678-4745-ac85-2f720846aff2
:END:

*** Lexical bindings

Very basic ~org-mode~ setup.

#+begin_src emacs-lisp :tangle "chris-lisp/chris-emacs-org.el" :mkdirp yes
  ;;; chris-emacs-org.el -*- lexical-bindings: t; -*-
  (require 'org)
#+end_src

*** Variable initialization
:PROPERTIES:
:ID:       7ed0f1a6-266d-4bd7-a2d8-4b01426e32ff
:END:

Begin by initializing some basic org variables.

#+begin_src emacs-lisp :tangle "chris-lisp/chris-emacs-org.el" :mkdirp yes
  (setq org-return-follows-link t
        org-hide-emphasis-markers t
        org-src-fontify-natively t
        org-pretty-entities t
        org-image-actual-width nil)

  (plist-put org-format-latex-options :scale 2.0)

  (setq org-agenda-files (list "~/media/org"))
#+end_src

*** Hooks
:PROPERTIES:
:ID:       678b485d-f9b6-4f09-a568-441c854bbf4a
:END:

#+begin_src emacs-lisp :tangle "chris-lisp/chris-emacs-org.el" :mkdirp yes
  (add-hook 'org-mode-hook #'visual-line-mode)
  (add-hook 'before-save-hook 'time-stamp nil)
  ;;(add-hook 'org-mode-hook #'variable-pitch-mode)
#+end_src

*** Tasks
:PROPERTIES:
:ID:       ea838a78-6b29-4c5b-b409-ca9d427e9386
:END:

#+begin_src emacs-lisp :tangle "chris-lisp/chris-emacs-org.el" :mkdirp yes
  (setq org-todo-keywords '((sequence "TODO(t)" "DOING(g)" "|" "DONE(d)")
                            (sequence "BLOCKED(b)" "|" "CANCELLED(c)")))
#+end_src

*** Babel Blocks
:PROPERTIES:
:ID:       c9a92f06-7006-42aa-bf64-3a690d46d8b1
:END:

I use ~org-babel~ and don't need confirmation before evaluating a block.
And the languages need to be set up.

#+begin_src emacs-lisp :tangle "chris-lisp/chris-emacs-org.el" :mkdirp yes
  (org-babel-do-load-languages 'org-babel-load-languages
                               '((shell .t)
                                 (js . t)
                                 (emacs-lisp .t)
                                 (python . t)
                                 (clojure . t)
                                 (ruby . t)))
#+end_src

*** Providing the module
:PROPERTIES:
:ID:       3d70163b-89a1-47e9-92c0-a8b6ec84570a
:END:

#+begin_src emacs-lisp :tangle "chris-lisp/chris-emacs-org.el" :mkdirp yes
  (provide 'chris-emacs-org)
#+end_src

** The =chris-completion= module
:PROPERTIES:
:ID:       d7d54bba-4cb4-49b9-9163-4b465d7fdbe0
:END:

Module that specifies the ~Completing Read User Interface~.
The packages I use extend the original Emacs API unlike other
Completing Read Interfaces that attempt to do everything by themselves
by implementing backend-engines or complete replacements.

*** Lexical bindings
#+begin_src emacs-lisp :tangle "chris-lisp/chris-completion.el" :mkdirp yes
  ;;; chris-completion.el -*- lexical-binding: t; -*-
#+end_src
*** Some basic settings
:PROPERTIES:
:ID:       a189caf9-1c81-4510-abf0-cadf62944561
:END:

These are primarily for file completions.

#+begin_src emacs-lisp :tangle "chris-lisp/chris-completion.el" :mkdirp yes
  (savehist-mode)
  (recentf-mode)
#+end_src

*** Vertico
The vertico packge puts the completing read in a vertical format, and it extends
Emacs' built-in functionality, instead of adding a new process. This means all these
packages work together.

#+begin_src emacs-lisp :tangle "chris-lisp/chris-completion.el" :mkdirp yes
  (use-package vertico
    :config
    (vertico-mode))

  (use-package vertico-directory
    :after vertico
    :ensure nil
    :bind (:map vertico-map
                ("RET" . vertico-directory-enter)
                ("DEL" . vertico-directory-delete-char)
                ("M-DEL" . vertico-directory-delete-word))
    :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))
#+end_src

*** Orderless
:PROPERTIES:
:ID:       c51016f9-2a53-4fb4-abfc-996cbb91d4da
:END:

While the space can be used to separate words (acting a bit like a =.*= regular expression),
the orderless project allows those words to be in any order.

#+begin_src emacs-lisp :tangle "chris-lisp/chris-completion.el" :mkdirp yes
  (use-package orderless
    :commands (orderless-filter)
    :custom
    (completion-ignore-case t)
    (completion-category-defaults nil)
    (completion-category-overrides '((file (styles partial-completion))))
    :init
    (defvar orderless-skip-highlighting nil
      "Not sure why this is being accessed.")

    (push 'orderless completion-styles))
#+end_src

*** Consult
:PROPERTIES:
:ID:       3e32f34e-134d-4ca5-80c7-c911bb38a528
:END:

Doesn't really belong here, but I don't know where to put it.
Consult provides basic functions to interact with all sorts of stuff.

#+begin_src emacs-lisp :tangle "chris-lisp/chris-completion.el" :mkdirp yes
  ;; Example configuration for Consult
  (use-package consult
    ;; Replace bindings. Lazily loaded due by `use-package'.
    :bind (;; C-c bindings in `mode-specific-map'
           ("C-c M-x" . consult-mode-command)
           ("C-c h" . consult-history)
           ("C-c k" . consult-kmacro)
           ("C-c m" . consult-man)
           ("C-c i" . consult-info)
           ([remap Info-search] . consult-info)
           ;; C-x bindings in `ctl-x-map'
           ("C-x M-:" . consult-complex-command)     ;; orig. repeat-complex-command
           ("C-x b" . consult-buffer)                ;; orig. switch-to-buffer
           ("C-x 4 b" . consult-buffer-other-window) ;; orig. switch-to-buffer-other-window
           ("C-x 5 b" . consult-buffer-other-frame)  ;; orig. switch-to-buffer-other-frame
           ("C-x t b" . consult-buffer-other-tab)    ;; orig. switch-to-buffer-other-tab
           ("C-x r b" . consult-bookmark)            ;; orig. bookmark-jump
           ("C-x C-r" . consult-recent-file)
           ("C-x p b" . consult-project-buffer)      ;; orig. project-switch-to-buffer
           ;; Custom M-# bindings for fast register access
           ("M-#" . consult-register-load)
           ("M-'" . consult-register-store)          ;; orig. abbrev-prefix-mark (unrelated)
           ("C-M-#" . consult-register)
           ;; Other custom bindings
           ("M-y" . consult-yank-pop)                ;; orig. yank-pop
           ;; M-g bindings in `goto-map'
           ("M-g e" . consult-compile-error)
           ("M-g f" . consult-flymake)               ;; Alternative: consult-flycheck
           ("M-g g" . consult-goto-line)             ;; orig. goto-line
           ("M-g M-g" . consult-goto-line)           ;; orig. goto-line
           ("M-g o" . consult-outline)               ;; Alternative: consult-org-heading
           ("M-g m" . consult-mark)
           ("M-g k" . consult-global-mark)
           ("M-g i" . consult-imenu)
           ("M-g I" . consult-imenu-multi)
           ;; M-s bindings in `search-map'
           ("M-s d" . consult-find)                  ;; Alternative: consult-fd
           ("M-s c" . consult-locate)
           ("M-s g" . consult-grep)
           ("M-s G" . consult-git-grep)
           ("M-s r" . consult-ripgrep)
           ("M-s l" . consult-line)
           ("M-s L" . consult-line-multi)
           ("M-s k" . consult-keep-lines)
           ("M-s u" . consult-focus-lines)
           ;; Isearch integration
           ("M-s e" . consult-isearch-history)
           :map isearch-mode-map
           ("M-e" . consult-isearch-history)         ;; orig. isearch-edit-string
           ("M-s e" . consult-isearch-history)       ;; orig. isearch-edit-string
           ("C-s" . consult-line)
           ("M-s l" . consult-line)                  ;; needed by consult-line to detect isearch
           ("M-s L" . consult-line-multi)            ;; needed by consult-line to detect isearch
           ;; Minibuffer history
           :map minibuffer-local-map
           ("M-s" . consult-history)                 ;; orig. next-matching-history-element
           ("M-r" . consult-history))                ;; orig. previous-matching-history-element

    ;; Enable automatic preview at point in the *Completions* buffer. This is
    ;; relevant when you use the default completion UI.
    :hook (completion-list-mode . consult-preview-at-point-mode)

    ;; The :init configuration is always executed (Not lazy)
    :init

    ;; Optionally configure the register formatting. This improves the register
    ;; preview for `consult-register', `consult-register-load',
    ;; `consult-register-store' and the Emacs built-ins.
    (setq register-preview-delay 0.5
          register-preview-function #'consult-register-format)

    ;; Optionally tweak the register preview window.
    ;; This adds thin lines, sorting and hides the mode line of the window.
    (advice-add #'register-preview :override #'consult-register-window)

    ;; Use Consult to select xref locations with preview
    (setq xref-show-xrefs-function #'consult-xref
          xref-show-definitions-function #'consult-xref)

    ;; Configure other variables and modes in the :config section,
    ;; after lazily loading the package.
    :config

    ;; Optionally configure preview. The default value
    ;; is 'any, such that any key triggers the preview.
    ;; (setq consult-preview-key 'any)
    ;; (setq consult-preview-key "M-.")
    ;; (setq consult-preview-key '("S-<down>" "S-<up>"))
    ;; For some commands and buffer sources it is useful to configure the
    ;; :preview-key on a per-command basis using the `consult-customize' macro.
    (consult-customize
     consult-theme :preview-key '(:debounce 0.2 any)
     consult-ripgrep consult-git-grep consult-grep
     consult-bookmark consult-recent-file consult-xref
     consult--source-bookmark consult--source-file-register
     consult--source-recent-file consult--source-project-recent-file
     ;; :preview-key "M-."
     :preview-key '(:debounce 0.4 any))

    ;; Optionally configure the narrowing key.
    ;; Both < and C-+ work reasonably well.
    (setq consult-narrow-key "<") ;; "C-+"

    ;; Optionally make narrowing help available in the minibuffer.
    ;; You may want to use `embark-prefix-help-command' or which-key instead.
    ;; (define-key consult-narrow-map (vconcat consult-narrow-key "?") #'consult-narrow-help)

    ;; By default `consult-project-function' uses `project-root' from project.el.
    ;; Optionally configure a different project root function.
      ;;;; 1. project.el (the default)
    ;; (setq consult-project-function #'consult--default-project--function)
      ;;;; 2. vc.el (vc-root-dir)
    ;; (setq consult-project-function (lambda (_) (vc-root-dir)))
      ;;;; 3. locate-dominating-file
    ;; (setq consult-project-function (lambda (_) (locate-dominating-file "." ".git")))
      ;;;; 4. projectile.el (projectile-project-root)
    ;; (autoload 'projectile-project-root "projectile")
    ;; (setq consult-project-function (lambda (_) (projectile-project-root)))
      ;;;; 5. No project support
    ;; (setq consult-project-function nil)
    )
#+end_src

*** Providing the module
:PROPERTIES:
:ID:       7daf03c3-0d5f-455a-a5e2-edae73cbdf05
:END:

#+begin_src emacs-lisp :tangle "chris-lisp/chris-completion.el" :mkdirp yes
  (provide 'chris-completion)
#+end_src

** The =chris-evil= module
:PROPERTIES:
:ID:       4880fd18-cf29-4514-8da2-f3a891cfc995
:END:

The Emacs keybindings by themselves are fine.
However, I often switch between systems that may no have Emacs installed.
Therefore I choose to use evil-mode, because it is the best vim emulation
for Emacs.
Vi(m) is the default editor on most Unix systems.

*** Lexical bindings
#+begin_src emacs-lisp :tangle "chris-lisp/chris-evil.el" :mkdirp yes
  ;;; chris-evil.el -*- lexical-binding: t; -*-
#+end_src

*** Evil mode
:PROPERTIES:
:ID:       d8200a9c-1410-46bf-8ef1-c95bb64a6820
:END:

The Emacs Vi Layer.
This is not the most efficient/fast keybinding scheme for Emacs.
However as stated above, Vi(m) is the default.

#+begin_src emacs-lisp :tangle "chris-lisp/chris-evil.el" :mkdirp yes
  (use-package evil
    :init
    (setq evil-search-module 'isearch)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-d-scroll t)
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-split-window-below t)
    (setq evil-vsplit-window-right nil)
    (setq evil-want-C-i-jump nil)
    (setq evil-undo-system 'undo-redo) ;; Emacs 28+
    :config
    (evil-mode t))
#+end_src

