chris-lisp/chris-emacs-ui.el

;; (setq modus-themes-mixed-fonts t)
;; (load-theme 'modus-vivendi t)
;; (use-package color-theme-sanityinc-tomorrow)

(use-package doom-themes
  :config
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic nil)
  (load-theme 'doom-gruvbox t))

(use-package spacious-padding
  :init
  (spacious-padding-mode t))

(provide 'chris-emacs-ui)
