chris-lisp/chris-evil.el
;;; chris-evil.el -*- lexical-binding: t; -*-

(use-package evil
  :init
  (setq evil-search-module 'isearch)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-d-scroll t)
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-split-window-below t)
  (setq evil-vsplit-window-right nil)
  (setq evil-want-C-i-jump nil)
  (setq evil-undo-system 'undo-redo) ;; Emacs 28+
  :config
  (evil-mode t))
