chris-emacs.org
*** Evil collection
:PROPERTIES:
:ID:       3df9d860-80c3-4a78-b8c8-8bee3f43b333
:END:

Vim Keybindings for non text derived buffers.

#+begin_src emacs-lisp :tangle "chris-lisp/chris-evil.el" :mkdirp yes
  (use-package evil-collection
    :after evil
    :init
    (setq evil-collection-outline-bind-tab-p t)
    :config
    (evil-collection-init))
#+end_src

*** Evil commentary
:PROPERTIES:
:ID:       e81f0761-00fc-42a0-bfd9-5f32d45a99de
:END:

Ease keybindings to comments based on major mode.

#+begin_src emacs-lisp :tangle "chris-lisp/chris-evil.el" :mkdirp yes
  (use-package evil-commentary
    :after evil
    :config
    (evil-commentary-mode))
#+end_src

*** Better jumps
:PROPERTIES:
:ID:       f1f18e2b-bbc6-475f-bc26-dc6a1f6a17af
:END:

By default, the =C-d= and =C-u= jumps don't center the cursor position.
This fixes that annoying behavior.

#+begin_src emacs-lisp :tangle "chris-lisp/chris-evil.el" :mkdir yes
  ;; C-d: center cursor after jump
  (defun chris/scroll-down-and-center ()
    "Scroll down and center the text to the screen"
    (interactive)
    (evil-scroll-down 0)
    (evil-scroll-line-to-center (line-number-at-pos)))
  (define-key evil-motion-state-map (kbd "\C-d") 'chris/scroll-down-and-center)

  ;; C-u: center cursor after jump
  (defun chris/scroll-up-and-center ()
    "Scroll up and center the text to the screen"
    (interactive)
    (evil-scroll-up 0)
    (evil-scroll-line-to-center (line-number-at-pos)))
  (define-key evil-motion-state-map (kbd "\C-u") 'chris/scroll-up-and-center)
#+end_src

*** Providing the module

#+begin_src emacs-lisp :tangle "chris-lisp/chris-evil.el" :mkdirp yes
  (provide 'chris-evil)
#+end_src

** The =chris-programming= module
:PROPERTIES:
:ID:       1488cb7b-7aac-43c4-8f4b-8f98e0ebc1cf
:END:

This section serves as a point of entry for all things related to programming
buffers. This includes the setup of programming languages.

*** Lexical bindings
#+begin_src emacs-lisp :tangle "chris-lisp/chris-programming.el" :mkdirp yes
  ;;; chris-programming.el -*- lexical-binding: t; -*-
#+end_src

*** Direnv
:PROPERTIES:
:ID:       55f935cc-1d9e-46d1-89ae-8adaa1f8f1f9
:END:

Direnv is useful for setting up enviroments.

#+begin_src emacs-lisp :tangle "chris-lisp/chris-programming.el" :mkdirp yes
  (use-package direnv
    :init
    (direnv-mode))
#+end_src

*** Treesitter
:PROPERTIES:
:ID:       47b70333-ee0c-4c9d-883d-22bd48a4751f
:END:

Since Emacs 29 Treesitter is built-in to the editor.
It is fast and does the job for what it is supposed to do.
A more convenient and feature full alternative is the
~tree-sitter~ package.

#+begin_src emacs-lisp :tangle "chris-lisp/chris-programming.el" :mkdirp yes
  (setq treesit-language-source-alist
        '((bash "https://github.com/tree-sitter/tree-sitter-bash")
          (go "https://github.com/tree-sitter/tree-sitter-go")
          (scala "https://github.com/tree-sitter/tree-sitter-scala")
          (python "https://github.com/tree-sitter/tree-sitter-python")
          (c "https://github.com/tree-sitter/tree-sitter-c")))

  ;; run this line once or every time a grammar needs an update
  ;; (mapc #'treesit-install-language-grammar (mapcar #'car treesit-language-source-alist))

  (setq major-mode-remap-alist
        '((bash-mode . bash-ts-mode)
          (go-mode . go-ts-mode)
          ;;(scala-mode . scala-ts-mode)
          (python-mode . python-ts-mode)
          (c-mode . c-ts-mode)))

  ;; maximum fontification
  (setq treesit-font-lock-level 4)
#+end_src

*** Formatting
:PROPERTIES:
:ID:       ad6f2fc0-d606-426a-a0d2-f4ddec3c9742
:END:

Remove trailing whitespaces in every ~prog-mode~ derived major-mode.

#+begin_src emacs-lisp :tangle "chris-lisp/chris-programming.el" :mkdirp yes
  (add-hook 'before-save-hook 'chris/prog-nuke-trailing-whitespace)

  (defun chris/prog-nuke-trailing-whitespace ()
    (when (derived-mode-p 'prog-mode)
      (delete-trailing-whitespace)))
#+end_src

*** LSP
:PROPERTIES:
:ID:       a2f57bab-19fc-4d2f-89f2-7bbc2ab221c3
:END:

Eglot is fine as LSP client.

#+begin_src emacs-lisp :tangle "chris-lisp/chris-programming.el" :mkdirp yes
  (defun chris/eglot-organize-imports ()
    (interactive)
    (eglot-code-actions nil nil "source.organizeImports" t))
  (add-hook 'before-save-hook 'chris/eglot-organize-imports nil t)
  (add-hook 'before-save-hook 'eglot-format-buffer)
#+end_src

*** Language configuration
:PROPERTIES:
:ID:       c7425a1b-f953-4984-b264-db4d1716fea2
:END:

#+begin_src emacs-lisp :tangle "chris-lisp/chris-programming.el" :mkdirp yes
  (use-package scala-mode
    :interpreter ("scala" . scala-mode))

  (use-package pyvenv)
#+end_src

*** Completion
:PROPERTIES:
:ID:       415d0ece-34f1-4656-9a3d-80349668cbef
:END:

I am personally not a big fan of popup windows.
Therefore I use the builtin ~completion-at-point~.

#+begin_src emacs-lisp :tangle "chris-lisp/chris-programming.el" :mkdirp yes
  (use-package company
    :custom
    (company-minimum-prefix-length 3)
    (company-idle-delay 0.5)
    :config
    (global-company-mode))
#+end_src

*** Providing the module
#+begin_src emacs-lisp :tangle "chris-lisp/chris-programming.el" :mkdirp yes
  (provide 'chris-programming)
#+end_src

** The =chris-denote= module
:PROPERTIES:
:ID:       fe0c54ab-abfc-4214-a438-d53f40815c28
:END:

*** Lexical bindings

#+begin_src emacs-lisp :tangle "chris-lisp/chris-denote.el" :mkdirp yes
  ;;; chris-denote.el -*- lexical-binding: t; -*-
#+end_src

*** Denote

Denote is a relatively simple note taking system.
It focuses on plain text files and an efficient naming scheme instead
of relying on external databases or online storage.
This makes it simple to write other clients because the system
doesn't necessarily rely on Emacs.

#+begin_src emacs-lisp :tangle "chris-lisp/chris-denote.el" :mkdirp yes
  (setq chris-notes-directory "~/media/org/notes/")

  (use-package denote
    :init
    (require 'denote-org-extras)
    (denote-rename-buffer-mode 1)
    :hook
    (dired-mode . denote-dired-mode)
    :custom-face
    (denote-faces-link ((t (:slant italic)))))

  (setq denote-directory (expand-file-name "~/media/org/notes"))
#+end_src

*** Providing the module

#+begin_src emacs-lisp :tangle "chris-lisp/chris-denote.el" :mkdirp yes
  (provide 'chris-denote)
#+end_src

** The =chris-misc= module
:PROPERTIES:
:ID:       61293408-b964-47c3-ada5-e9cc37b14fa1
:END:

A collection of miscelaneous packages that make life easier.

=which-key= is a minor mode for Emacs that displays the key bindings following
the currently entered incomplete commands (a prefix) in a popup.
Since Emacs keybindings are hard to remember, this is a must have.

=emms= is a music player for Emacs. Nothing special here.

#+begin_src emacs-lisp :tangle "chris-lisp/chris-misc.el" :mkdirp yes
  ;;; chris-misc.el -*- lexical-binding :t; -*-
  (use-package which-key
    :init
    (which-key-mode))

  (use-package emms
    :config
    (require 'emms-setup)
    (require 'emms-player-mpd)
    (emms-all)
    (setq emms-player-list '(emms-player-mpd))
    (add-to-list 'emms-info-functions 'emms-info-mpd)
    (add-to-list 'emms-player-list 'emms-player-mpd)
    (setq emms-player-mpd-server-name "localhost")
    (setq emms-player-mpd-server-port "6600")
    (setq emms-player-mpd-music-directory "~/media/music"))

  (use-package pdf-tools
    :config
    (pdf-tools-install)
    (setq-default pdf-view-display-size 'fit-page))

  (provide 'chris-misc)
#+end_src
